import TeleBot from 'telebot';

// Инициализация бота
const bot = new TeleBot(process.env.TELEGRAM_BOT_TOKEN);

// Массив для хранения chatId пользователей
const users = new Set();

let startCommandCounter = 0;

// Обработчик команды /start
bot.on('/start', async (msg) => {
  startCommandCounter++;
  console.log(`Received /start command. Counter: ${startCommandCounter}`);

  const chatId = msg.chat.id;
  const firstName = msg.from.first_name || 'there';

  // Сохраняем chatId пользователя
  users.add(chatId);
  console.log(`Added user: ${chatId}`);

  // Сообщение с кнопками выбора языка
  const languageSelectionMessage = `Привет, ${firstName}! 🎉\n\nПожалуйста, выбери язык:`;

  await bot.sendMessage(chatId, languageSelectionMessage, {
    parseMode: 'Markdown',
    replyMarkup: bot.inlineKeyboard([
      [bot.inlineButton('Русский 🇷🇺', { callback: 'ru' })],
      [bot.inlineButton('Беларусский 🇧🇾', { callback: 'be' })],
      [bot.inlineButton('Казахстанский 🇰🇿', { callback: 'kk' })]
    ])
  });
});

// Обработчик нажатия кнопки выбора языка
bot.on('callbackQuery', async (msg) => {
  const chatId = msg.message.chat.id;
  const selectedLanguage = msg.data;

  let firstMessage = '';
  let rulesMessage = '';

  if (selectedLanguage === 'ru') {
    firstMessage = `Привет! 🎉\n\nМы рады, что ты решил попробовать нашу новую игру!\n\nОна создана специально для того, чтобы помочь тебе научиться финансовой грамотности в увлекательном формате гонки. Чем быстрее и правильнее ты будешь отвечать на вопросы, тем быстрее поедет твой автомобиль!\n\nЧтобы начать игру, просто нажми на кнопку ниже. Удачи и приятного путешествия в мир финансов! 🚀💰`;
    rulesMessage = `Благодарим тебя за проявленный интерес!\n\nФинГонки - игра на базе приложения Телеграм. Чтобы принять участие не нужно скачивать дополнительные файлы или переходить на другие сайты - все легко и быстро! 🚀\n\nДействие игры начинается в главном меню, здесь ты можешь перейти в один из 3 разделов:\n1. Карта 🗺\n2. Гараж 🏠\n3. Таблица лидеров 🏅\n\n📍 Карта – ключевая точка, с которой начинается любой заезд в ФинГонках! Выбирай район и погружайся в мир финансовой грамотности! Дальше тебя ждет небольшой теоретический блок с полезной информацией, только после него начинается настоящая гонка! Чем быстрее и правильнее ты отвечаешь на вопросы по пройденному материалу, тем быстрее едет твой автомобиль! Будь внимательным и не дай сопернику себя обогнать! Каждая победа приносит денежный приз и очки славы 🏆\n\n📍 Гараж – место, где находятся все твои автомобили (все как в жизни!) Здесь ты можешь выбрать новый транспорт или прокачать уже имеющийся. Распоряжайся своими средствами с умом!\n\n📍 Таблица лидеров – здесь ты можешь посмотреть свое место в рейтинге, сравнить свои достижения с друзьями и насладиться своими победами!\n\nПоехали? 🏎🏎`;
  } else if (selectedLanguage === 'be') {
    firstMessage = `Вітаем! 🎉\n\nМы рады, што ты вырашыў спрабаваць нашу новую гульню!\n\nЯна створана спецыяльна для таго, каб дапамагчы табе вывучыць фінансавую грамацнасць у цікавым фармаце гонак. Чым хутчэй і правільней ты будзеш адказваць на пытанні, тым хутчэй паедзе твой аўтамабіль!\n\nКаб пачаць гульню, проста націсні на кнопку ніжэй. Пошчасці і прыемнай падарожы ў свет фінансаў! 🚀💰`;
    rulesMessage = `Дзякуем за праяўлены інтарэс!\n\nФінГонкі - гульня на аснове прыкладання Тэлеграм. Каб прыняць удзел не трэба запампаваць дадатковыя файлы або пераходзіць на іншыя сайты - усё лёгка і хутка! 🚀\n\nДзеянне гульні пачынаецца ў галоўным меню, тут ты можаш перайсці ў адзін з 3 раздзелаў:\n1. Карта 🗺\n2. Гараж 🏠\n3. Табліца лідараў 🏅\n\n📍 Карта – ключавая кропка, з якой пачынаецца любы заезд у ФінГонках! Выбірай раён і пагружайся ў свет фінансавай грамацнасці! Далей цябе чакае невялічкі тэарэтычны блок з карыснай інфармацыяй, толькі пасля яго пачынаецца сапраўдная гонка! Чым хутчэй і правільней ты адказваеш на пытанні па прайдзеным матэрыяле, тым хутчэй едзе твой аўтамабіль! Будзь уважлівым і не дай суперніку сябе абгнаць! Каждая перамога прыносіць грашовы прыз і балы славы 🏆\n\n📍 Гараж – месца, дзе знаходзяцца ўсе твае аўтамабілі (усё як у жыцці!) Тут ты можаш выбраць новы транспарт або пракачаць ужо існуючы. Распараджайся сваімі сродкамі з розумам!\n\n📍 Табліца лідараў – тут ты можаш паглядзець сваё месца ў рэйтынгу, параўнаць свае дасягненні з сябрамі і насладзіцца сваімі перамогамі!\n\nПоехалі? 🏎🏎`;
  } else if (selectedLanguage === 'kk') {
    firstMessage = `Сәлем! 🎉\n\nБіз оңайыңызды жаңа ойынды сынап көруге шешіміңізге қуаныштымыз!\n\nОл қиялдағы автожарыста қиындықтарды қиялдағы қаржылық сауаттылықты үйрену үшін арналған.\n\nСіз тапсырмаларға тезірек және дұрыс жауап берсеңіз, сіздің автокөлігіңіз тезірек жүреді!\n\nОйынды бастау үшін төмендегі түймеге басыңыз. Құтты болсын және қаржы әлемінде жақсы сапар болсын! 🚀💰`;
    rulesMessage = `Қызықтырудың көрсеткен қызығушылығыңызға рахмет!\n\nФинГонки - Telegram қолданбасының негізіндегі ойын. Қатысу үшін қосымша файлдарды жүктемеу немесе басқа сайттарға өту қажет емес - барлығы оңай және тез! 🚀\n\nОйын әрекеті негізгі менюден басталады, мұнда сіз 3 бөлімнің біреуіне өтуіңізге болады:\n1. Карта 🗺\n2. Гараж 🏠\n3. Лидерлер кестесі 🏅\n\n📍 Карта - ФинГонкадағы әрбір жарыс басталатын негізгі нүкте! Аймақты таңдаңыз және қаржылық сауаттылық әлеміне бұрылыңыз! Кейін сіз пайдалы ақпаратпен қысқа теориялық блок күтеді, тек содан кейін нағыз жарыс басталады! Өткен материал бойынша тапсырмаларға тезірек және дұрыс жауап берсеңіз, сіздің автокөлігіңіз тезірек жүреді! Ескеріңіз және қарсыластың сізді асып түсуге мүмкіндік бермеңіз! Әрбір жеңіс қаржылық жүлде және даңқ ұпайларын әкеледі 🏆\n\n📍 Гараж - барлық автокөліктеріңіз орналасқан жер (барлығы тіріліктегідей!). Мұнда сіз жаңа транспортты таңдауға немесе әзір барушыны жақсартуға болады. Өзіңіздің қаражатыңызды ақылмен пайдаланыңыз!\n\n📍 Лидерлер кестесі - мұнда сіз өзіңіздің рейтингтегі орныңызды көруіңізге, достыңызбен салыстыруыңызға және жеңістеріңізбен ләззаттануыңызға болады!\n\nПоехали? 🏎🏎`;
  }

  // Отправка первого сообщения с кнопками
  await bot.sendMessage(chatId, firstMessage, {
    parseMode: 'Markdown',
    replyMarkup: bot.inlineKeyboard([
      [bot.inlineButton('Начать игру 🕹', { url: 'https://racingapp.devnullteam.ru' })],
      [bot.inlineButton('Правила 📜', { callback: 'show_rules' })]
    ])
  });

  // Обработчик нажатия кнопки "Правила"
  if (msg.data === 'show_rules') {
    await bot.sendMessage(chatId, rulesMessage, { parseMode: 'Markdown' });
  }
});

export default bot;
